resources/foam/pitzDaily/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale   1.0;

vertices
(
    (0 0 -0.5)			//0
    (0 1 -0.5)			//1
    (1 -1 -0.5)			//2
    (1 0 -0.5)			//3
    (1 1 -0.5)			//4
    (10 -1 -0.5)		//5
    (10 0 -0.5)			//6
    (10 1 -0.5)			//7

    (0 0 0.5)			//8
    (0 1 0.5)			//9
    (1 -1 0.5)			//10
    (1 0 0.5)			//11
    (1 1 0.5)			//12
    (10 -1 0.5)			//13
    (10 0 0.5)			//14
    (10 1 0.5)			//15
);

blocks
(
    hex (0 3 4 1 8 11 12 9) (10 10 1) simpleGrading (1 1 1)  	// Block 0
    hex (2 5 6 3 10 13 14 11) (90 10 1) simpleGrading (1 1 1)  	// Block 1
    hex (3 6 7 4 11 14 15 12) (90 10 1) simpleGrading (1 1 1)  	// Block 2
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 9 8)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (5 6 14 13)
            (6 7 15 14)
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (1 4 12 9)
            (4 7 15 12)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 3 11 8)
            (2 3 11 10)
            (2 5 13 10)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 4 1)
            (2 5 6 3)
            (3 6 7 4)
            (8 11 12 9)
            (10 13 14 11)
            (11 14 15 12)
        );
    }
);
