resources/foam/pitzDaily/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          10;
        startFace       3680;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       3690;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       3710;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          110;
        startFace       3810;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3800;
        startFace       3920;
    }
)

// ************************************************************************* //
